Revit 2027 API
BuiltInFailures.GeometryFailures.ElementIsTooThin Property
 [Element] is too thin.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ElementIsTooThin { get; }
Public Shared ReadOnly Property ElementIsTooThin As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ElementIsTooThin {
	FailureDefinitionId^ get ();
}
static member ElementIsTooThin : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.GeometryFailures Class
Autodesk.Revit.DB Namespace